---
title: TrussFailures
classe: Autodesk.Revit.DB.BuiltInFailures+TrussFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# TrussFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId IncorrectWallUsageWithAttachedStruct { get; }` | `TrussFailures.IncorrectWallUsageWithAttachedStruct` | FailureDefinitionId |
| `FailureDefinitionId InvalidWorkplaneForStructuralFraming { get; }` | `TrussFailures.InvalidWorkplaneForStructuralFraming` | FailureDefinitionId |
| `FailureDefinitionId RemoveTrussSketch { get; }` | `TrussFailures.RemoveTrussSketch` | FailureDefinitionId |
| `FailureDefinitionId TrussBadTransformation { get; }` | `TrussFailures.TrussBadTransformation` | FailureDefinitionId |
| `FailureDefinitionId TrussChordUntransformable { get; }` | `TrussFailures.TrussChordUntransformable` | FailureDefinitionId |
| `FailureDefinitionId TrussDuplicateEngineeringType { get; }` | `TrussFailures.TrussDuplicateEngineeringType` | FailureDefinitionId |
| `FailureDefinitionId TrussInvalidSymbolGeom { get; }` | `TrussFailures.TrussInvalidSymbolGeom` | FailureDefinitionId |
| `FailureDefinitionId TrussIsAttachedTo { get; }` | `TrussFailures.TrussIsAttachedTo` | FailureDefinitionId |
| `FailureDefinitionId TrussLayoutNonSympleTopChord { get; }` | `TrussFailures.TrussLayoutNonSympleTopChord` | FailureDefinitionId |
| `FailureDefinitionId TrussLayoutOverlapedCurves { get; }` | `TrussFailures.TrussLayoutOverlapedCurves` | FailureDefinitionId |
| `FailureDefinitionId TrussNotJoinedWebs { get; }` | `TrussFailures.TrussNotJoinedWebs` | FailureDefinitionId |
| `FailureDefinitionId TrussUserDefinedMemberDeleted { get; }` | `TrussFailures.TrussUserDefinedMemberDeleted` | FailureDefinitionId |
| `FailureDefinitionId TrussUserDefinedMemberNotJoined { get; }` | `TrussFailures.TrussUserDefinedMemberNotJoined` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```